In [19]:
import numpy as np
import pandas as pd

import pandas as pd

# Create a dictionary with employee data
data = {
    'Employee Name': ['Alice', 'Bob', 'Carol', 'David', 'Eve','Mark'],
    'Salary': [50000, 60000, 55000, 62000, 58000,80000],
    'Department': ['HR', 'IT', 'Finance', 'IT', 'HR','IT']
}

# Create a DataFrame from the dictionary
df = pd.DataFrame(data)

# Show the DataFrame
print(df)

  Employee Name  Salary Department
0         Alice   50000         HR
1           Bob   60000         IT
2         Carol   55000    Finance
3         David   62000         IT
4           Eve   58000         HR
5          Mark   80000         IT

In [51]:
df.query("Department == 'IT' and Salary>=50000")

  Employee Name  Salary Department
1           Bob   60000         IT
3         David   62000         IT
5          Mark   80000         IT